app/views/reserve/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."username" = 'orlando' LIMIT 1
---
<% if User.find_by_username(@username)%>