app/views/reserve/save.html.erb

SELECT "users".* FROM "users"
---
<%else%>
  <%=User.all.each do |u|%>